TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_gpioc.h
typedef struct {
       uint32_t RESERVED0[256];
  __IO uint32_t FSUB_0;                            /* !< (@ 0x00000400) Subsciber Port 0 */
  __IO uint32_t FSUB_1;                            /* !< (@ 0x00000404) Subscriber Port 1 */
       uint32_t RESERVED1[15];
  __IO uint32_t FPUB_0;                            /* !< (@ 0x00000444) Publisher Port 0 */
  __IO uint32_t FPUB_1;                            /* !< (@ 0x00000448) Publisher Port 1 */
       uint32_t RESERVED2[237];
  GPIOC_GPRCM_Regs  GPRCM;                             /* !< (@ 0x00000800) */
       uint32_t RESERVED3[510];
  __IO uint32_t CLKOVR;                            /* !< (@ 0x00001010) Clock Override */
       uint32_t RESERVED4;
  __IO uint32_t PDBGCTL;                           /* !< (@ 0x00001018) Peripheral Debug Control */
       uint32_t RESERVED5;
  GPIOC_CPU_INT_Regs  CPU_INT;                           /* !< (@ 0x00001020) */
       uint32_t RESERVED6;
  GPIOC_GEN_EVENT0_Regs  GEN_EVENT0;                        /* !< (@ 0x00001050) */
       uint32_t RESERVED7;
  GPIOC_GEN_EVENT1_Regs  GEN_EVENT1;                        /* !< (@ 0x00001080) */
       uint32_t RESERVED8[13];
  __IO uint32_t EVT_MODE;                          /* !< (@ 0x000010E0) Event Mode */
       uint32_t RESERVED9[6];
  __I  uint32_t DESC;                              /* !< (@ 0x000010FC) Module Description */
       uint32_t RESERVED10[64];
  __O  uint32_t DOUT3_0;                           /* !< (@ 0x00001200) Data output 3 to 0 */
  __O  uint32_t DOUT7_4;                           /* !< (@ 0x00001204) Data output 7 to 4 */
  __O  uint32_t DOUT11_8;                          /* !< (@ 0x00001208) Data output 11 to 8 */
  __O  uint32_t DOUT15_12;                         /* !< (@ 0x0000120C) Data output 15 to 12 */
  __O  uint32_t DOUT19_16;                         /* !< (@ 0x00001210) Data output 19 to 16 */
  __O  uint32_t DOUT23_20;                         /* !< (@ 0x00001214) Data output 23 to 20 */
  __O  uint32_t DOUT27_24;                         /* !< (@ 0x00001218) Data output 27 to 24 */
  __O  uint32_t DOUT31_28;                         /* !< (@ 0x0000121C) Data output 31 to 28 */
       uint32_t RESERVED11[24];
  __IO uint32_t DOUT31_0;                          /* !< (@ 0x00001280) Data output 31 to 0 */
       uint32_t RESERVED12[3];
  __O  uint32_t DOUTSET31_0;                       /* !< (@ 0x00001290) Data output set 31 to 0 */
       uint32_t RESERVED13[3];
  __O  uint32_t DOUTCLR31_0;                       /* !< (@ 0x000012A0) Data output clear 31 to 0 */
       uint32_t RESERVED14[3];
  __O  uint32_t DOUTTGL31_0;                       /* !< (@ 0x000012B0) Data output toggle 31 to 0 */
       uint32_t RESERVED15[3];
  __IO uint32_t DOE31_0;                           /* !< (@ 0x000012C0) Data output enable 31 to 0 */
       uint32_t RESERVED16[3];
  __O  uint32_t DOESET31_0;                        /* !< (@ 0x000012D0) Data output enable set 31 to 0 */
       uint32_t RESERVED17[3];
  __O  uint32_t DOECLR31_0;                        /* !< (@ 0x000012E0) Data output enable clear 31 to 0 */
       uint32_t RESERVED18[7];
  __I  uint32_t DIN3_0;                            /* !< (@ 0x00001300) Data input 3 to 0 */
  __I  uint32_t DIN7_4;                            /* !< (@ 0x00001304) Data input 7 to 4 */
  __I  uint32_t DIN11_8;                           /* !< (@ 0x00001308) Data input 11 to 8 */
  __I  uint32_t DIN15_12;                          /* !< (@ 0x0000130C) Data input 15 to 12 */
  __I  uint32_t DIN19_16;                          /* !< (@ 0x00001310) Data input 19 to 16 */
  __I  uint32_t DIN23_20;                          /* !< (@ 0x00001314) Data input 23 to 20 */
  __I  uint32_t DIN27_24;                          /* !< (@ 0x00001318) Data input 27 to 24 */
  __I  uint32_t DIN31_28;                          /* !< (@ 0x0000131C) Data input 31 to 28 */
       uint32_t RESERVED19[24];
  __I  uint32_t DIN31_0;                           /* !< (@ 0x00001380) Data input 31 to 0 */
       uint32_t RESERVED20[3];
  __IO uint32_t POLARITY15_0;                      /* !< (@ 0x00001390) Polarity 15 to 0 */
       uint32_t RESERVED21[3];
  __IO uint32_t POLARITY31_16;                     /* !< (@ 0x000013A0) Polarity 31 to 16 */
       uint32_t RESERVED22[23];
  __IO uint32_t CTL;                               /* !< (@ 0x00001400) FAST WAKE GLOBAL EN */
  __IO uint32_t FASTWAKE;                          /* !< (@ 0x00001404) FAST WAKE ENABLE */
       uint32_t RESERVED23[62];
  __IO uint32_t SUB0CFG;                           /* !< (@ 0x00001500) Subscriber 0 configuration */
       uint32_t RESERVED24;
  __IO uint32_t FILTEREN15_0;                      /* !< (@ 0x00001508) Filter Enable 15 to 0 */
  __IO uint32_t FILTEREN31_16;                     /* !< (@ 0x0000150C) Filter Enable 31 to 16 */
  __IO uint32_t DMAMASK;                           /* !< (@ 0x00001510) DMA Write MASK */
       uint32_t RESERVED25[3];
  __IO uint32_t SUB1CFG;                           /* !< (@ 0x00001520) Subscriber 1 configuration */
} GPIOC_Regs;

/*@}*/ /* end of group GPIOC */



#if defined ( __CC_ARM )
#pragma no_anon_unions
#endif

/******************************************************************************
* GPIOC Register Control Bits
******************************************************************************/

/* GPIOC_GEN_EVENT1_IIDX Bits */
/* GPIOC_GEN_EVENT1_IIDX[STAT] Bits */
#define GPIOC_GEN_EVENT1_IIDX_STAT_OFS           (0)                             /* !< STAT Offset */
#define GPIOC_GEN_EVENT1_IIDX_STAT_MASK          ((uint32_t)0x000000FFU)         /* !< Interrupt index status */
#define GPIOC_GEN_EVENT1_IIDX_STAT_NO_INTR       ((uint32_t)0x00000000U)         /* !< No bit is set means there is no
                                                                                    pending interrupt request */
#define GPIOC_GEN_EVENT1_IIDX_STAT_DIO16         ((uint32_t)0x00000001U)         /* !< DIO0 interrupt */
#define GPIOC_GEN_EVENT1_IIDX_STAT_DIO17         ((uint32_t)0x00000002U)         /* !< DIO1 interrupt */
#define GPIOC_GEN_EVENT1_IIDX_STAT_DIO18         ((uint32_t)0x00000003U)         /* !< DIO2 interrupt */
#define GPIOC_GEN_EVENT1_IIDX_STAT_DIO19         ((uint32_t)0x00000004U)         /* !< DIO3 interrupt */
#define GPIOC_GEN_EVENT1_IIDX_STAT_DIO20         ((uint32_t)0x00000005U)         /* !< DIO4 interrupt */
#define GPIOC_GEN_EVENT1_IIDX_STAT_DIO21         ((uint32_t)0x00000006U)         /* !< DIO5 interrupt */
#define GPIOC_GEN_EVENT1_IIDX_STAT_DIO22         ((uint32_t)0x00000007U)         /* !< DIO6 interrupt */
#define GPIOC_GEN_EVENT1_IIDX_STAT_DIO23         ((uint32_t)0x00000008U)         /* !< DIO7 interrupt */
#define GPIOC_GEN_EVENT1_IIDX_STAT_DIO24         ((uint32_t)0x00000009U)         /* !< DIO8 interrupt */
#define GPIOC_GEN_EVENT1_IIDX_STAT_DIO25         ((uint32_t)0x0000000AU)         /* !< DIO9 interrupt */
#define GPIOC_GEN_EVENT1_IIDX_STAT_DIO26         ((uint32_t)0x0000000BU)         /* !< DIO10 interrupt */
#define GPIOC_GEN_EVENT1_IIDX_STAT_DIO27         ((uint32_t)0x0000000CU)         /* !< DIO11 interrupt */
#define GPIOC_GEN_EVENT1_IIDX_STAT_DIO28         ((uint32_t)0x0000000DU)         /* !< DIO12 interrupt */
#define GPIOC_GEN_EVENT1_IIDX_STAT_DIO29         ((uint32_t)0x0000000EU)         /* !< DIO13 interrupt */
#define GPIOC_GEN_EVENT1_IIDX_STAT_DIO30         ((uint32_t)0x0000000FU)         /* !< DIO14 interrupt */
#define GPIOC_GEN_EVENT1_IIDX_STAT_DIO31         ((uint32_t)0x00000010U)         /* !< DIO15 interrupt */

