TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_gpioc.h
/* GPIOC_GEN_EVENT0_IIDX Bits */
/* GPIOC_GEN_EVENT0_IIDX[STAT] Bits */
#define GPIOC_GEN_EVENT0_IIDX_STAT_OFS           (0)                             /* !< STAT Offset */
#define GPIOC_GEN_EVENT0_IIDX_STAT_MASK          ((uint32_t)0x000000FFU)         /* !< Interrupt index status */
#define GPIOC_GEN_EVENT0_IIDX_STAT_NO_INTR       ((uint32_t)0x00000000U)         /* !< No bit is set means there is no
                                                                                    pending interrupt request */
#define GPIOC_GEN_EVENT0_IIDX_STAT_DIO0          ((uint32_t)0x00000001U)         /* !< DIO0 interrupt */
#define GPIOC_GEN_EVENT0_IIDX_STAT_DIO1          ((uint32_t)0x00000002U)         /* !< DIO1 interrupt */
#define GPIOC_GEN_EVENT0_IIDX_STAT_DIO2          ((uint32_t)0x00000003U)         /* !< DIO2 interrupt */
#define GPIOC_GEN_EVENT0_IIDX_STAT_DIO3          ((uint32_t)0x00000004U)         /* !< DIO3 interrupt */
#define GPIOC_GEN_EVENT0_IIDX_STAT_DIO4          ((uint32_t)0x00000005U)         /* !< DIO4 interrupt */
#define GPIOC_GEN_EVENT0_IIDX_STAT_DIO5          ((uint32_t)0x00000006U)         /* !< DIO5 interrupt */
#define GPIOC_GEN_EVENT0_IIDX_STAT_DIO6          ((uint32_t)0x00000007U)         /* !< DIO6 interrupt */
#define GPIOC_GEN_EVENT0_IIDX_STAT_DIO7          ((uint32_t)0x00000008U)         /* !< DIO7 interrupt */
#define GPIOC_GEN_EVENT0_IIDX_STAT_DIO8          ((uint32_t)0x00000009U)         /* !< DIO8 interrupt */
#define GPIOC_GEN_EVENT0_IIDX_STAT_DIO9          ((uint32_t)0x0000000AU)         /* !< DIO9 interrupt */
#define GPIOC_GEN_EVENT0_IIDX_STAT_DIO10         ((uint32_t)0x0000000BU)         /* !< DIO10 interrupt */
#define GPIOC_GEN_EVENT0_IIDX_STAT_DIO11         ((uint32_t)0x0000000CU)         /* !< DIO11 interrupt */
#define GPIOC_GEN_EVENT0_IIDX_STAT_DIO12         ((uint32_t)0x0000000DU)         /* !< DIO12 interrupt */
#define GPIOC_GEN_EVENT0_IIDX_STAT_DIO13         ((uint32_t)0x0000000EU)         /* !< DIO13 interrupt */
#define GPIOC_GEN_EVENT0_IIDX_STAT_DIO14         ((uint32_t)0x0000000FU)         /* !< DIO14 interrupt */
#define GPIOC_GEN_EVENT0_IIDX_STAT_DIO15         ((uint32_t)0x00000010U)         /* !< DIO15 interrupt */

/* GPIOC_GEN_EVENT0_IMASK Bits */
/* GPIOC_GEN_EVENT0_IMASK[DIO0] Bits */
#define GPIOC_GEN_EVENT0_IMASK_DIO0_OFS          (0)                             /* !< DIO0 Offset */
#define GPIOC_GEN_EVENT0_IMASK_DIO0_MASK         ((uint32_t)0x00000001U)         /* !< DIO0 event mask */
#define GPIOC_GEN_EVENT0_IMASK_DIO0_CLR          ((uint32_t)0x00000000U)         /* !< Event is masked */
#define GPIOC_GEN_EVENT0_IMASK_DIO0_SET          ((uint32_t)0x00000001U)         /* !< Event is unmasked */
/* GPIOC_GEN_EVENT0_IMASK[DIO1] Bits */
#define GPIOC_GEN_EVENT0_IMASK_DIO1_OFS          (1)                             /* !< DIO1 Offset */
#define GPIOC_GEN_EVENT0_IMASK_DIO1_MASK         ((uint32_t)0x00000002U)         /* !< DIO1 event mask */
#define GPIOC_GEN_EVENT0_IMASK_DIO1_CLR          ((uint32_t)0x00000000U)         /* !< Event is masked */
#define GPIOC_GEN_EVENT0_IMASK_DIO1_SET          ((uint32_t)0x00000002U)         /* !< Event is unmasked */
/* GPIOC_GEN_EVENT0_IMASK[DIO2] Bits */
#define GPIOC_GEN_EVENT0_IMASK_DIO2_OFS          (2)                             /* !< DIO2 Offset */
#define GPIOC_GEN_EVENT0_IMASK_DIO2_MASK         ((uint32_t)0x00000004U)         /* !< DIO2 event mask */
#define GPIOC_GEN_EVENT0_IMASK_DIO2_CLR          ((uint32_t)0x00000000U)         /* !< Event is masked */
#define GPIOC_GEN_EVENT0_IMASK_DIO2_SET          ((uint32_t)0x00000004U)         /* !< Event is unmasked */
/* GPIOC_GEN_EVENT0_IMASK[DIO3] Bits */
#define GPIOC_GEN_EVENT0_IMASK_DIO3_OFS          (3)                             /* !< DIO3 Offset */
#define GPIOC_GEN_EVENT0_IMASK_DIO3_MASK         ((uint32_t)0x00000008U)         /* !< DIO3 event mask */
#define GPIOC_GEN_EVENT0_IMASK_DIO3_CLR          ((uint32_t)0x00000000U)         /* !< Event is masked */
#define GPIOC_GEN_EVENT0_IMASK_DIO3_SET          ((uint32_t)0x00000008U)         /* !< Event is unmasked */
/* GPIOC_GEN_EVENT0_IMASK[DIO4] Bits */
#define GPIOC_GEN_EVENT0_IMASK_DIO4_OFS          (4)                             /* !< DIO4 Offset */
#define GPIOC_GEN_EVENT0_IMASK_DIO4_MASK         ((uint32_t)0x00000010U)         /* !< DIO4 event mask */
#define GPIOC_GEN_EVENT0_IMASK_DIO4_CLR          ((uint32_t)0x00000000U)         /* !< Event is masked */
#define GPIOC_GEN_EVENT0_IMASK_DIO4_SET          ((uint32_t)0x00000010U)         /* !< Event is unmasked */
/* GPIOC_GEN_EVENT0_IMASK[DIO5] Bits */
#define GPIOC_GEN_EVENT0_IMASK_DIO5_OFS          (5)                             /* !< DIO5 Offset */
#define GPIOC_GEN_EVENT0_IMASK_DIO5_MASK         ((uint32_t)0x00000020U)         /* !< DIO5 event mask */
#define GPIOC_GEN_EVENT0_IMASK_DIO5_CLR          ((uint32_t)0x00000000U)         /* !< Event is masked */
#define GPIOC_GEN_EVENT0_IMASK_DIO5_SET          ((uint32_t)0x00000020U)         /* !< Event is unmasked */
/* GPIOC_GEN_EVENT0_IMASK[DIO6] Bits */
#define GPIOC_GEN_EVENT0_IMASK_DIO6_OFS          (6)                             /* !< DIO6 Offset */
#define GPIOC_GEN_EVENT0_IMASK_DIO6_MASK         ((uint32_t)0x00000040U)         /* !< DIO6 event mask */
#define GPIOC_GEN_EVENT0_IMASK_DIO6_CLR          ((uint32_t)0x00000000U)         /* !< Event is masked */
#define GPIOC_GEN_EVENT0_IMASK_DIO6_SET          ((uint32_t)0x00000040U)         /* !< Event is unmasked */
/* GPIOC_GEN_EVENT0_IMASK[DIO7] Bits */
#define GPIOC_GEN_EVENT0_IMASK_DIO7_OFS          (7)                             /* !< DIO7 Offset */
#define GPIOC_GEN_EVENT0_IMASK_DIO7_MASK         ((uint32_t)0x00000080U)         /* !< DIO7 event mask */
#define GPIOC_GEN_EVENT0_IMASK_DIO7_CLR          ((uint32_t)0x00000000U)         /* !< Event is masked */
#define GPIOC_GEN_EVENT0_IMASK_DIO7_SET          ((uint32_t)0x00000080U)         /* !< Event is unmasked */
/* GPIOC_GEN_EVENT0_IMASK[DIO8] Bits */
#define GPIOC_GEN_EVENT0_IMASK_DIO8_OFS          (8)                             /* !< DIO8 Offset */
#define GPIOC_GEN_EVENT0_IMASK_DIO8_MASK         ((uint32_t)0x00000100U)         /* !< DIO8 event mask */
#define GPIOC_GEN_EVENT0_IMASK_DIO8_CLR          ((uint32_t)0x00000000U)         /* !< Event is masked */
#define GPIOC_GEN_EVENT0_IMASK_DIO8_SET          ((uint32_t)0x00000100U)         /* !< Event is unmasked */
/* GPIOC_GEN_EVENT0_IMASK[DIO9] Bits */
#define GPIOC_GEN_EVENT0_IMASK_DIO9_OFS          (9)                             /* !< DIO9 Offset */
#define GPIOC_GEN_EVENT0_IMASK_DIO9_MASK         ((uint32_t)0x00000200U)         /* !< DIO9 event mask */
#define GPIOC_GEN_EVENT0_IMASK_DIO9_CLR          ((uint32_t)0x00000000U)         /* !< Event is masked */
#define GPIOC_GEN_EVENT0_IMASK_DIO9_SET          ((uint32_t)0x00000200U)         /* !< Event is unmasked */
/* GPIOC_GEN_EVENT0_IMASK[DIO10] Bits */
#define GPIOC_GEN_EVENT0_IMASK_DIO10_OFS         (10)                            /* !< DIO10 Offset */
#define GPIOC_GEN_EVENT0_IMASK_DIO10_MASK        ((uint32_t)0x00000400U)         /* !< DIO10 event mask */
#define GPIOC_GEN_EVENT0_IMASK_DIO10_CLR         ((uint32_t)0x00000000U)         /* !< Event is masked */
#define GPIOC_GEN_EVENT0_IMASK_DIO10_SET         ((uint32_t)0x00000400U)         /* !< Event is unmasked */
/* GPIOC_GEN_EVENT0_IMASK[DIO11] Bits */
#define GPIOC_GEN_EVENT0_IMASK_DIO11_OFS         (11)                            /* !< DIO11 Offset */
#define GPIOC_GEN_EVENT0_IMASK_DIO11_MASK        ((uint32_t)0x00000800U)         /* !< DIO11 event mask */
#define GPIOC_GEN_EVENT0_IMASK_DIO11_CLR         ((uint32_t)0x00000000U)         /* !< Event is masked */
#define GPIOC_GEN_EVENT0_IMASK_DIO11_SET         ((uint32_t)0x00000800U)         /* !< Event is unmasked */
/* GPIOC_GEN_EVENT0_IMASK[DIO12] Bits */
#define GPIOC_GEN_EVENT0_IMASK_DIO12_OFS         (12)                            /* !< DIO12 Offset */
#define GPIOC_GEN_EVENT0_IMASK_DIO12_MASK        ((uint32_t)0x00001000U)         /* !< DIO12 event mask */
#define GPIOC_GEN_EVENT0_IMASK_DIO12_CLR         ((uint32_t)0x00000000U)         /* !< Event is masked */
#define GPIOC_GEN_EVENT0_IMASK_DIO12_SET         ((uint32_t)0x00001000U)         /* !< Event is unmasked */
/* GPIOC_GEN_EVENT0_IMASK[DIO13] Bits */
#define GPIOC_GEN_EVENT0_IMASK_DIO13_OFS         (13)                            /* !< DIO13 Offset */
#define GPIOC_GEN_EVENT0_IMASK_DIO13_MASK        ((uint32_t)0x00002000U)         /* !< DIO13 event mask */
#define GPIOC_GEN_EVENT0_IMASK_DIO13_CLR         ((uint32_t)0x00000000U)         /* !< Event is masked */
#define GPIOC_GEN_EVENT0_IMASK_DIO13_SET         ((uint32_t)0x00002000U)         /* !< Event is unmasked */
/* GPIOC_GEN_EVENT0_IMASK[DIO14] Bits */
#define GPIOC_GEN_EVENT0_IMASK_DIO14_OFS         (14)                            /* !< DIO14 Offset */
#define GPIOC_GEN_EVENT0_IMASK_DIO14_MASK        ((uint32_t)0x00004000U)         /* !< DIO14 event mask */
#define GPIOC_GEN_EVENT0_IMASK_DIO14_CLR         ((uint32_t)0x00000000U)         /* !< Event is masked */
#define GPIOC_GEN_EVENT0_IMASK_DIO14_SET         ((uint32_t)0x00004000U)         /* !< Event is unmasked */
/* GPIOC_GEN_EVENT0_IMASK[DIO15] Bits */
#define GPIOC_GEN_EVENT0_IMASK_DIO15_OFS         (15)                            /* !< DIO15 Offset */
#define GPIOC_GEN_EVENT0_IMASK_DIO15_MASK        ((uint32_t)0x00008000U)         /* !< DIO15 event mask */
#define GPIOC_GEN_EVENT0_IMASK_DIO15_CLR         ((uint32_t)0x00000000U)         /* !< Event is masked */
#define GPIOC_GEN_EVENT0_IMASK_DIO15_SET         ((uint32_t)0x00008000U)         /* !< Event is unmasked */

