TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_gpioc.h
/* GPIOC_GEN_EVENT0_RIS Bits */
/* GPIOC_GEN_EVENT0_RIS[DIO0] Bits */
#define GPIOC_GEN_EVENT0_RIS_DIO0_OFS            (0)                             /* !< DIO0 Offset */
#define GPIOC_GEN_EVENT0_RIS_DIO0_MASK           ((uint32_t)0x00000001U)         /* !< DIO0 event */
#define GPIOC_GEN_EVENT0_RIS_DIO0_CLR            ((uint32_t)0x00000000U)         /* !< DIO0 event did not occur */
#define GPIOC_GEN_EVENT0_RIS_DIO0_SET            ((uint32_t)0x00000001U)         /* !< DIO0 event occurred */
/* GPIOC_GEN_EVENT0_RIS[DIO1] Bits */
#define GPIOC_GEN_EVENT0_RIS_DIO1_OFS            (1)                             /* !< DIO1 Offset */
#define GPIOC_GEN_EVENT0_RIS_DIO1_MASK           ((uint32_t)0x00000002U)         /* !< DIO1 event */
#define GPIOC_GEN_EVENT0_RIS_DIO1_CLR            ((uint32_t)0x00000000U)         /* !< DIO1 event did not occur */
#define GPIOC_GEN_EVENT0_RIS_DIO1_SET            ((uint32_t)0x00000002U)         /* !< DIO1 event occurred */
/* GPIOC_GEN_EVENT0_RIS[DIO2] Bits */
#define GPIOC_GEN_EVENT0_RIS_DIO2_OFS            (2)                             /* !< DIO2 Offset */
#define GPIOC_GEN_EVENT0_RIS_DIO2_MASK           ((uint32_t)0x00000004U)         /* !< DIO2 event */
#define GPIOC_GEN_EVENT0_RIS_DIO2_CLR            ((uint32_t)0x00000000U)         /* !< DIO2 event did not occur */
#define GPIOC_GEN_EVENT0_RIS_DIO2_SET            ((uint32_t)0x00000004U)         /* !< DIO2 event occurred */
/* GPIOC_GEN_EVENT0_RIS[DIO3] Bits */
#define GPIOC_GEN_EVENT0_RIS_DIO3_OFS            (3)                             /* !< DIO3 Offset */
#define GPIOC_GEN_EVENT0_RIS_DIO3_MASK           ((uint32_t)0x00000008U)         /* !< DIO3 event */
#define GPIOC_GEN_EVENT0_RIS_DIO3_CLR            ((uint32_t)0x00000000U)         /* !< DIO3 event did not occur */
#define GPIOC_GEN_EVENT0_RIS_DIO3_SET            ((uint32_t)0x00000008U)         /* !< DIO3 event occurred */
/* GPIOC_GEN_EVENT0_RIS[DIO4] Bits */
#define GPIOC_GEN_EVENT0_RIS_DIO4_OFS            (4)                             /* !< DIO4 Offset */
#define GPIOC_GEN_EVENT0_RIS_DIO4_MASK           ((uint32_t)0x00000010U)         /* !< DIO4 event */
#define GPIOC_GEN_EVENT0_RIS_DIO4_CLR            ((uint32_t)0x00000000U)         /* !< DIO4 event did not occur */
#define GPIOC_GEN_EVENT0_RIS_DIO4_SET            ((uint32_t)0x00000010U)         /* !< DIO4 event occurred */
/* GPIOC_GEN_EVENT0_RIS[DIO5] Bits */
#define GPIOC_GEN_EVENT0_RIS_DIO5_OFS            (5)                             /* !< DIO5 Offset */
#define GPIOC_GEN_EVENT0_RIS_DIO5_MASK           ((uint32_t)0x00000020U)         /* !< DIO5 event */
#define GPIOC_GEN_EVENT0_RIS_DIO5_CLR            ((uint32_t)0x00000000U)         /* !< DIO5 event did not occur */
#define GPIOC_GEN_EVENT0_RIS_DIO5_SET            ((uint32_t)0x00000020U)         /* !< DIO5 event occurred */
/* GPIOC_GEN_EVENT0_RIS[DIO6] Bits */
#define GPIOC_GEN_EVENT0_RIS_DIO6_OFS            (6)                             /* !< DIO6 Offset */
#define GPIOC_GEN_EVENT0_RIS_DIO6_MASK           ((uint32_t)0x00000040U)         /* !< DIO6 event */
#define GPIOC_GEN_EVENT0_RIS_DIO6_CLR            ((uint32_t)0x00000000U)         /* !< DIO6 event did not occur */
#define GPIOC_GEN_EVENT0_RIS_DIO6_SET            ((uint32_t)0x00000040U)         /* !< DIO6 event occurred */
/* GPIOC_GEN_EVENT0_RIS[DIO7] Bits */
#define GPIOC_GEN_EVENT0_RIS_DIO7_OFS            (7)                             /* !< DIO7 Offset */
#define GPIOC_GEN_EVENT0_RIS_DIO7_MASK           ((uint32_t)0x00000080U)         /* !< DIO7 event */
#define GPIOC_GEN_EVENT0_RIS_DIO7_CLR            ((uint32_t)0x00000000U)         /* !< DIO7 event did not occur */
#define GPIOC_GEN_EVENT0_RIS_DIO7_SET            ((uint32_t)0x00000080U)         /* !< DIO7 event occurred */
/* GPIOC_GEN_EVENT0_RIS[DIO8] Bits */
#define GPIOC_GEN_EVENT0_RIS_DIO8_OFS            (8)                             /* !< DIO8 Offset */
#define GPIOC_GEN_EVENT0_RIS_DIO8_MASK           ((uint32_t)0x00000100U)         /* !< DIO8 event */
#define GPIOC_GEN_EVENT0_RIS_DIO8_CLR            ((uint32_t)0x00000000U)         /* !< DIO8 event did not occur */
#define GPIOC_GEN_EVENT0_RIS_DIO8_SET            ((uint32_t)0x00000100U)         /* !< DIO8 event occurred */
/* GPIOC_GEN_EVENT0_RIS[DIO9] Bits */
#define GPIOC_GEN_EVENT0_RIS_DIO9_OFS            (9)                             /* !< DIO9 Offset */
#define GPIOC_GEN_EVENT0_RIS_DIO9_MASK           ((uint32_t)0x00000200U)         /* !< DIO9 event */
#define GPIOC_GEN_EVENT0_RIS_DIO9_CLR            ((uint32_t)0x00000000U)         /* !< DIO9 event did not occur */
#define GPIOC_GEN_EVENT0_RIS_DIO9_SET            ((uint32_t)0x00000200U)         /* !< DIO9 event occurred */
/* GPIOC_GEN_EVENT0_RIS[DIO10] Bits */
#define GPIOC_GEN_EVENT0_RIS_DIO10_OFS           (10)                            /* !< DIO10 Offset */
#define GPIOC_GEN_EVENT0_RIS_DIO10_MASK          ((uint32_t)0x00000400U)         /* !< DIO10 event */
#define GPIOC_GEN_EVENT0_RIS_DIO10_CLR           ((uint32_t)0x00000000U)         /* !< DIO10 event did not occur */
#define GPIOC_GEN_EVENT0_RIS_DIO10_SET           ((uint32_t)0x00000400U)         /* !< DIO10 event occurred */
/* GPIOC_GEN_EVENT0_RIS[DIO11] Bits */
#define GPIOC_GEN_EVENT0_RIS_DIO11_OFS           (11)                            /* !< DIO11 Offset */
#define GPIOC_GEN_EVENT0_RIS_DIO11_MASK          ((uint32_t)0x00000800U)         /* !< DIO11 event */
#define GPIOC_GEN_EVENT0_RIS_DIO11_CLR           ((uint32_t)0x00000000U)         /* !< DIO11 event did not occur */
#define GPIOC_GEN_EVENT0_RIS_DIO11_SET           ((uint32_t)0x00000800U)         /* !< DIO11 event occurred */
/* GPIOC_GEN_EVENT0_RIS[DIO12] Bits */
#define GPIOC_GEN_EVENT0_RIS_DIO12_OFS           (12)                            /* !< DIO12 Offset */
#define GPIOC_GEN_EVENT0_RIS_DIO12_MASK          ((uint32_t)0x00001000U)         /* !< DIO12 event */
#define GPIOC_GEN_EVENT0_RIS_DIO12_CLR           ((uint32_t)0x00000000U)         /* !< DIO12 event did not occur */
#define GPIOC_GEN_EVENT0_RIS_DIO12_SET           ((uint32_t)0x00001000U)         /* !< DIO12 event occurred */
/* GPIOC_GEN_EVENT0_RIS[DIO13] Bits */
#define GPIOC_GEN_EVENT0_RIS_DIO13_OFS           (13)                            /* !< DIO13 Offset */
#define GPIOC_GEN_EVENT0_RIS_DIO13_MASK          ((uint32_t)0x00002000U)         /* !< DIO13 event */
#define GPIOC_GEN_EVENT0_RIS_DIO13_CLR           ((uint32_t)0x00000000U)         /* !< DIO13 event did not occur */
#define GPIOC_GEN_EVENT0_RIS_DIO13_SET           ((uint32_t)0x00002000U)         /* !< DIO13 event occurred */
/* GPIOC_GEN_EVENT0_RIS[DIO14] Bits */
#define GPIOC_GEN_EVENT0_RIS_DIO14_OFS           (14)                            /* !< DIO14 Offset */
#define GPIOC_GEN_EVENT0_RIS_DIO14_MASK          ((uint32_t)0x00004000U)         /* !< DIO14 event */
#define GPIOC_GEN_EVENT0_RIS_DIO14_CLR           ((uint32_t)0x00000000U)         /* !< DIO14 event did not occur */
#define GPIOC_GEN_EVENT0_RIS_DIO14_SET           ((uint32_t)0x00004000U)         /* !< DIO14 event occurred */
/* GPIOC_GEN_EVENT0_RIS[DIO15] Bits */
#define GPIOC_GEN_EVENT0_RIS_DIO15_OFS           (15)                            /* !< DIO15 Offset */
#define GPIOC_GEN_EVENT0_RIS_DIO15_MASK          ((uint32_t)0x00008000U)         /* !< DIO15 event */
#define GPIOC_GEN_EVENT0_RIS_DIO15_CLR           ((uint32_t)0x00000000U)         /* !< DIO15 event did not occur */
#define GPIOC_GEN_EVENT0_RIS_DIO15_SET           ((uint32_t)0x00008000U)         /* !< DIO15 event occurred */

/* GPIOC_GEN_EVENT0_MIS Bits */
/* GPIOC_GEN_EVENT0_MIS[DIO0] Bits */
#define GPIOC_GEN_EVENT0_MIS_DIO0_OFS            (0)                             /* !< DIO0 Offset */
#define GPIOC_GEN_EVENT0_MIS_DIO0_MASK           ((uint32_t)0x00000001U)         /* !< DIO0 event */
#define GPIOC_GEN_EVENT0_MIS_DIO0_CLR            ((uint32_t)0x00000000U)         /* !< DIO0 event did not occur */
#define GPIOC_GEN_EVENT0_MIS_DIO0_SET            ((uint32_t)0x00000001U)         /* !< DIO0 event occurred */
/* GPIOC_GEN_EVENT0_MIS[DIO1] Bits */
#define GPIOC_GEN_EVENT0_MIS_DIO1_OFS            (1)                             /* !< DIO1 Offset */
#define GPIOC_GEN_EVENT0_MIS_DIO1_MASK           ((uint32_t)0x00000002U)         /* !< DIO1 event */
#define GPIOC_GEN_EVENT0_MIS_DIO1_CLR            ((uint32_t)0x00000000U)         /* !< DIO1 event did not occur */
#define GPIOC_GEN_EVENT0_MIS_DIO1_SET            ((uint32_t)0x00000002U)         /* !< DIO1 event occurred */
/* GPIOC_GEN_EVENT0_MIS[DIO2] Bits */
#define GPIOC_GEN_EVENT0_MIS_DIO2_OFS            (2)                             /* !< DIO2 Offset */
#define GPIOC_GEN_EVENT0_MIS_DIO2_MASK           ((uint32_t)0x00000004U)         /* !< DIO2 event */
#define GPIOC_GEN_EVENT0_MIS_DIO2_CLR            ((uint32_t)0x00000000U)         /* !< DIO2 event did not occur */
#define GPIOC_GEN_EVENT0_MIS_DIO2_SET            ((uint32_t)0x00000004U)         /* !< DIO2 event occurred */
/* GPIOC_GEN_EVENT0_MIS[DIO3] Bits */
#define GPIOC_GEN_EVENT0_MIS_DIO3_OFS            (3)                             /* !< DIO3 Offset */
#define GPIOC_GEN_EVENT0_MIS_DIO3_MASK           ((uint32_t)0x00000008U)         /* !< DIO3 event */
#define GPIOC_GEN_EVENT0_MIS_DIO3_CLR            ((uint32_t)0x00000000U)         /* !< DIO3 event did not occur */
#define GPIOC_GEN_EVENT0_MIS_DIO3_SET            ((uint32_t)0x00000008U)         /* !< DIO3 event occurred */
/* GPIOC_GEN_EVENT0_MIS[DIO4] Bits */
#define GPIOC_GEN_EVENT0_MIS_DIO4_OFS            (4)                             /* !< DIO4 Offset */
#define GPIOC_GEN_EVENT0_MIS_DIO4_MASK           ((uint32_t)0x00000010U)         /* !< DIO4 event */
#define GPIOC_GEN_EVENT0_MIS_DIO4_CLR            ((uint32_t)0x00000000U)         /* !< DIO4 event did not occur */
#define GPIOC_GEN_EVENT0_MIS_DIO4_SET            ((uint32_t)0x00000010U)         /* !< DIO4 event occurred */
/* GPIOC_GEN_EVENT0_MIS[DIO5] Bits */
#define GPIOC_GEN_EVENT0_MIS_DIO5_OFS            (5)                             /* !< DIO5 Offset */
#define GPIOC_GEN_EVENT0_MIS_DIO5_MASK           ((uint32_t)0x00000020U)         /* !< DIO5 event */
#define GPIOC_GEN_EVENT0_MIS_DIO5_CLR            ((uint32_t)0x00000000U)         /* !< DIO5 event did not occur */
#define GPIOC_GEN_EVENT0_MIS_DIO5_SET            ((uint32_t)0x00000020U)         /* !< DIO5 event occurred */
/* GPIOC_GEN_EVENT0_MIS[DIO6] Bits */
#define GPIOC_GEN_EVENT0_MIS_DIO6_OFS            (6)                             /* !< DIO6 Offset */
#define GPIOC_GEN_EVENT0_MIS_DIO6_MASK           ((uint32_t)0x00000040U)         /* !< DIO6 event */
#define GPIOC_GEN_EVENT0_MIS_DIO6_CLR            ((uint32_t)0x00000000U)         /* !< DIO6 event did not occur */
#define GPIOC_GEN_EVENT0_MIS_DIO6_SET            ((uint32_t)0x00000040U)         /* !< DIO6 event occurred */
/* GPIOC_GEN_EVENT0_MIS[DIO7] Bits */
#define GPIOC_GEN_EVENT0_MIS_DIO7_OFS            (7)                             /* !< DIO7 Offset */
#define GPIOC_GEN_EVENT0_MIS_DIO7_MASK           ((uint32_t)0x00000080U)         /* !< DIO7 event */
#define GPIOC_GEN_EVENT0_MIS_DIO7_CLR            ((uint32_t)0x00000000U)         /* !< DIO7 event did not occur */
#define GPIOC_GEN_EVENT0_MIS_DIO7_SET            ((uint32_t)0x00000080U)         /* !< DIO7 event occurred */
/* GPIOC_GEN_EVENT0_MIS[DIO8] Bits */
#define GPIOC_GEN_EVENT0_MIS_DIO8_OFS            (8)                             /* !< DIO8 Offset */
#define GPIOC_GEN_EVENT0_MIS_DIO8_MASK           ((uint32_t)0x00000100U)         /* !< DIO8 event */
#define GPIOC_GEN_EVENT0_MIS_DIO8_CLR            ((uint32_t)0x00000000U)         /* !< DIO8 event did not occur */
#define GPIOC_GEN_EVENT0_MIS_DIO8_SET            ((uint32_t)0x00000100U)         /* !< DIO8 event occurred */
/* GPIOC_GEN_EVENT0_MIS[DIO9] Bits */
#define GPIOC_GEN_EVENT0_MIS_DIO9_OFS            (9)                             /* !< DIO9 Offset */
#define GPIOC_GEN_EVENT0_MIS_DIO9_MASK           ((uint32_t)0x00000200U)         /* !< DIO9 event */
#define GPIOC_GEN_EVENT0_MIS_DIO9_CLR            ((uint32_t)0x00000000U)         /* !< DIO9 event did not occur */
#define GPIOC_GEN_EVENT0_MIS_DIO9_SET            ((uint32_t)0x00000200U)         /* !< DIO9 event occurred */
/* GPIOC_GEN_EVENT0_MIS[DIO10] Bits */
#define GPIOC_GEN_EVENT0_MIS_DIO10_OFS           (10)                            /* !< DIO10 Offset */
#define GPIOC_GEN_EVENT0_MIS_DIO10_MASK          ((uint32_t)0x00000400U)         /* !< DIO10 event */
#define GPIOC_GEN_EVENT0_MIS_DIO10_CLR           ((uint32_t)0x00000000U)         /* !< DIO10 event did not occur */
#define GPIOC_GEN_EVENT0_MIS_DIO10_SET           ((uint32_t)0x00000400U)         /* !< DIO10 event occurred */
/* GPIOC_GEN_EVENT0_MIS[DIO11] Bits */
#define GPIOC_GEN_EVENT0_MIS_DIO11_OFS           (11)                            /* !< DIO11 Offset */
#define GPIOC_GEN_EVENT0_MIS_DIO11_MASK          ((uint32_t)0x00000800U)         /* !< DIO11 event */
#define GPIOC_GEN_EVENT0_MIS_DIO11_CLR           ((uint32_t)0x00000000U)         /* !< DIO11 event did not occur */
#define GPIOC_GEN_EVENT0_MIS_DIO11_SET           ((uint32_t)0x00000800U)         /* !< DIO11 event occurred */
/* GPIOC_GEN_EVENT0_MIS[DIO12] Bits */
#define GPIOC_GEN_EVENT0_MIS_DIO12_OFS           (12)                            /* !< DIO12 Offset */
#define GPIOC_GEN_EVENT0_MIS_DIO12_MASK          ((uint32_t)0x00001000U)         /* !< DIO12 event */
#define GPIOC_GEN_EVENT0_MIS_DIO12_CLR           ((uint32_t)0x00000000U)         /* !< DIO12 event did not occur */
#define GPIOC_GEN_EVENT0_MIS_DIO12_SET           ((uint32_t)0x00001000U)         /* !< DIO12 event occurred */
/* GPIOC_GEN_EVENT0_MIS[DIO13] Bits */
#define GPIOC_GEN_EVENT0_MIS_DIO13_OFS           (13)                            /* !< DIO13 Offset */
#define GPIOC_GEN_EVENT0_MIS_DIO13_MASK          ((uint32_t)0x00002000U)         /* !< DIO13 event */
#define GPIOC_GEN_EVENT0_MIS_DIO13_CLR           ((uint32_t)0x00000000U)         /* !< DIO13 event did not occur */
#define GPIOC_GEN_EVENT0_MIS_DIO13_SET           ((uint32_t)0x00002000U)         /* !< DIO13 event occurred */
/* GPIOC_GEN_EVENT0_MIS[DIO14] Bits */
#define GPIOC_GEN_EVENT0_MIS_DIO14_OFS           (14)                            /* !< DIO14 Offset */
#define GPIOC_GEN_EVENT0_MIS_DIO14_MASK          ((uint32_t)0x00004000U)         /* !< DIO14 event */
#define GPIOC_GEN_EVENT0_MIS_DIO14_CLR           ((uint32_t)0x00000000U)         /* !< DIO14 event did not occur */
#define GPIOC_GEN_EVENT0_MIS_DIO14_SET           ((uint32_t)0x00004000U)         /* !< DIO14 event occurred */
/* GPIOC_GEN_EVENT0_MIS[DIO15] Bits */
#define GPIOC_GEN_EVENT0_MIS_DIO15_OFS           (15)                            /* !< DIO15 Offset */
#define GPIOC_GEN_EVENT0_MIS_DIO15_MASK          ((uint32_t)0x00008000U)         /* !< DIO15 event */
#define GPIOC_GEN_EVENT0_MIS_DIO15_CLR           ((uint32_t)0x00000000U)         /* !< DIO15 event did not occur */
#define GPIOC_GEN_EVENT0_MIS_DIO15_SET           ((uint32_t)0x00008000U)         /* !< DIO15 event occurred */

