TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_gpioc.h
/* GPIOC_PWREN Bits */
/* GPIOC_PWREN[ENABLE] Bits */
#define GPIOC_PWREN_ENABLE_OFS                   (0)                             /* !< ENABLE Offset */
#define GPIOC_PWREN_ENABLE_MASK                  ((uint32_t)0x00000001U)         /* !< Enable the power */
#define GPIOC_PWREN_ENABLE_DISABLE               ((uint32_t)0x00000000U)         /* !< Disable Power */
#define GPIOC_PWREN_ENABLE_ENABLE                ((uint32_t)0x00000001U)         /* !< Enable Power */
/* GPIOC_PWREN[KEY] Bits */
#define GPIOC_PWREN_KEY_OFS                      (24)                            /* !< KEY Offset */
#define GPIOC_PWREN_KEY_MASK                     ((uint32_t)0xFF000000U)         /* !< KEY to allow Power State Change */
#define GPIOC_PWREN_KEY_UNLOCK_W                 ((uint32_t)0x26000000U)         /* !< KEY to allow write access to this
                                                                                    register */

/* GPIOC_RSTCTL Bits */
/* GPIOC_RSTCTL[RESETSTKYCLR] Bits */
#define GPIOC_RSTCTL_RESETSTKYCLR_OFS            (1)                             /* !< RESETSTKYCLR Offset */
#define GPIOC_RSTCTL_RESETSTKYCLR_MASK           ((uint32_t)0x00000002U)         /* !< Clear the RESETSTKY bit in the STAT
                                                                                    register */
#define GPIOC_RSTCTL_RESETSTKYCLR_NOP            ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define GPIOC_RSTCTL_RESETSTKYCLR_CLR            ((uint32_t)0x00000002U)         /* !< Clear reset sticky bit */
/* GPIOC_RSTCTL[RESETASSERT] Bits */
#define GPIOC_RSTCTL_RESETASSERT_OFS             (0)                             /* !< RESETASSERT Offset */
#define GPIOC_RSTCTL_RESETASSERT_MASK            ((uint32_t)0x00000001U)         /* !< Assert reset to the peripheral */
#define GPIOC_RSTCTL_RESETASSERT_NOP             ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define GPIOC_RSTCTL_RESETASSERT_ASSERT          ((uint32_t)0x00000001U)         /* !< Assert reset */
/* GPIOC_RSTCTL[KEY] Bits */
#define GPIOC_RSTCTL_KEY_OFS                     (24)                            /* !< KEY Offset */
#define GPIOC_RSTCTL_KEY_MASK                    ((uint32_t)0xFF000000U)         /* !< Unlock key */
#define GPIOC_RSTCTL_KEY_UNLOCK_W                ((uint32_t)0xB1000000U)         /* !< KEY to allow write access to this
                                                                                    register */

/* GPIOC_STAT Bits */
/* GPIOC_STAT[RESETSTKY] Bits */
#define GPIOC_STAT_RESETSTKY_OFS                 (16)                            /* !< RESETSTKY Offset */
#define GPIOC_STAT_RESETSTKY_MASK                ((uint32_t)0x00010000U)         /* !< This bit indicates, if the
                                                                                    peripheral was reset, since this bit
                                                                                    was cleared by RESETSTKYCLR in the
                                                                                    RSTCTL register */
#define GPIOC_STAT_RESETSTKY_NORES               ((uint32_t)0x00000000U)         /* !< The peripheral has not been reset
                                                                                    since this bit was last cleared by
                                                                                    RESETSTKYCLR in the RSTCTL register */
#define GPIOC_STAT_RESETSTKY_RESET               ((uint32_t)0x00010000U)         /* !< The peripheral was reset since the
                                                                                    last bit clear */

/* GPIOC_FSUB_0 Bits */
/* GPIOC_FSUB_0[CHANID] Bits */
#define GPIOC_FSUB_0_CHANID_OFS                  (0)                             /* !< CHANID Offset */
#define GPIOC_FSUB_0_CHANID_MASK                 ((uint32_t)0x000001FFU)         /* !< 0 = disconnected. 1-15 = connected
                                                                                    to channelID = CHANID. */
#define GPIOC_FSUB_0_CHANID_MNIMUM               ((uint32_t)0x00000000U)         /* !< 0 is an allowed value, signifying
                                                                                    that the event is unconnected */
#define GPIOC_FSUB_0_CHANID_UNCONNECTED          ((uint32_t)0x00000000U)         /* !< A value of 0 specifies that the
                                                                                    event is not connected */
#define GPIOC_FSUB_0_CHANID_MAXIMUM              ((uint32_t)0x0000000FU)         /* !< Consult your device datasheet as
                                                                                    the actual allowed maximum may be
                                                                                    less than 15. */

/* GPIOC_FSUB_1 Bits */
/* GPIOC_FSUB_1[CHANID] Bits */
#define GPIOC_FSUB_1_CHANID_OFS                  (0)                             /* !< CHANID Offset */
#define GPIOC_FSUB_1_CHANID_MASK                 ((uint32_t)0x000001FFU)         /* !< 0 = disconnected. 1-15 = connected
                                                                                    to channelID = CHANID. */
#define GPIOC_FSUB_1_CHANID_MNIMUM               ((uint32_t)0x00000000U)         /* !< 0 is an allowed value, signifying
                                                                                    that the event is unconnected */
#define GPIOC_FSUB_1_CHANID_UNCONNECTED          ((uint32_t)0x00000000U)         /* !< A value of 0 specifies that the
                                                                                    event is not connected */
#define GPIOC_FSUB_1_CHANID_MAXIMUM              ((uint32_t)0x0000000FU)         /* !< Consult your device datasheet as
                                                                                    the actual allowed maximum may be
                                                                                    less than 15. */

