TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_gpioc.h
/* GPIOC_FPUB_0 Bits */
/* GPIOC_FPUB_0[CHANID] Bits */
#define GPIOC_FPUB_0_CHANID_OFS                  (0)                             /* !< CHANID Offset */
#define GPIOC_FPUB_0_CHANID_MASK                 ((uint32_t)0x000001FFU)         /* !< 0 = disconnected. 1-15 = connected
                                                                                    to channelID = CHANID. */
#define GPIOC_FPUB_0_CHANID_MNIMUM               ((uint32_t)0x00000000U)         /* !< 0 is an allowed value, signifying
                                                                                    that the event is unconnected */
#define GPIOC_FPUB_0_CHANID_UNCONNECTED          ((uint32_t)0x00000000U)         /* !< A value of 0 specifies that the
                                                                                    event is not connected */
#define GPIOC_FPUB_0_CHANID_MAXIMUM              ((uint32_t)0x0000000FU)         /* !< Consult your device datasheet as
                                                                                    the actual allowed maximum may be
                                                                                    less than 15. */

/* GPIOC_FPUB_1 Bits */
/* GPIOC_FPUB_1[CHANID] Bits */
#define GPIOC_FPUB_1_CHANID_OFS                  (0)                             /* !< CHANID Offset */
#define GPIOC_FPUB_1_CHANID_MASK                 ((uint32_t)0x000001FFU)         /* !< 0 = disconnected. 1-15 = connected
                                                                                    to channelID = CHANID. */
#define GPIOC_FPUB_1_CHANID_MNIMUM               ((uint32_t)0x00000000U)         /* !< 0 is an allowed value, signifying
                                                                                    that the event is unconnected */
#define GPIOC_FPUB_1_CHANID_UNCONNECTED          ((uint32_t)0x00000000U)         /* !< A value of 0 specifies that the
                                                                                    event is not connected */
#define GPIOC_FPUB_1_CHANID_MAXIMUM              ((uint32_t)0x0000000FU)         /* !< Consult your device datasheet as
                                                                                    the actual allowed maximum may be
                                                                                    less than 15. */

/* GPIOC_CLKOVR Bits */
/* GPIOC_CLKOVR[OVERRIDE] Bits */
#define GPIOC_CLKOVR_OVERRIDE_OFS                (0)                             /* !< OVERRIDE Offset */
#define GPIOC_CLKOVR_OVERRIDE_MASK               ((uint32_t)0x00000001U)         /* !< Unlocks the functionality of
                                                                                    [RUN_STOP] to override the automatic
                                                                                    peripheral clock request */
#define GPIOC_CLKOVR_OVERRIDE_DISABLED           ((uint32_t)0x00000000U)         /* !< Override disabled */
#define GPIOC_CLKOVR_OVERRIDE_ENABLED            ((uint32_t)0x00000001U)         /* !< Override enabled */
/* GPIOC_CLKOVR[RUN_STOP] Bits */
#define GPIOC_CLKOVR_RUN_STOP_OFS                (1)                             /* !< RUN_STOP Offset */
#define GPIOC_CLKOVR_RUN_STOP_MASK               ((uint32_t)0x00000002U)         /* !< If [OVERRIDE] is enabled, this
                                                                                    register is used to manually control
                                                                                    the peripheral's clock request to the
                                                                                    system */
#define GPIOC_CLKOVR_RUN_STOP_RUN                ((uint32_t)0x00000000U)         /* !< Run/ungate functional clock */
#define GPIOC_CLKOVR_RUN_STOP_STOP               ((uint32_t)0x00000002U)         /* !< Stop/gate functional clock */

/* GPIOC_PDBGCTL Bits */
/* GPIOC_PDBGCTL[FREE] Bits */
#define GPIOC_PDBGCTL_FREE_OFS                   (0)                             /* !< FREE Offset */
#define GPIOC_PDBGCTL_FREE_MASK                  ((uint32_t)0x00000001U)         /* !< Free run control */
#define GPIOC_PDBGCTL_FREE_STOP                  ((uint32_t)0x00000000U)         /* !< The peripheral freezes
                                                                                    functionality while the Core Halted
                                                                                    input is asserted and resumes when it
                                                                                    is deasserted. */
#define GPIOC_PDBGCTL_FREE_RUN                   ((uint32_t)0x00000001U)         /* !< The peripheral ignores the state of
                                                                                    the Core Halted input */

/* GPIOC_EVT_MODE Bits */
/* GPIOC_EVT_MODE[INT0_CFG] Bits */
#define GPIOC_EVT_MODE_INT0_CFG_OFS              (0)                             /* !< INT0_CFG Offset */
#define GPIOC_EVT_MODE_INT0_CFG_MASK             ((uint32_t)0x00000003U)         /* !< Event line mode select for event
                                                                                    corresponding to [IPSTANDARD.CPU_INT] */
#define GPIOC_EVT_MODE_INT0_CFG_DISABLE          ((uint32_t)0x00000000U)         /* !< The interrupt or event line is
                                                                                    disabled. */
#define GPIOC_EVT_MODE_INT0_CFG_SOFTWARE         ((uint32_t)0x00000001U)         /* !< The interrupt or event line is in
                                                                                    software mode. Software must clear
                                                                                    the RIS. */
#define GPIOC_EVT_MODE_INT0_CFG_HARDWARE         ((uint32_t)0x00000002U)         /* !< The interrupt or event line is in
                                                                                    hardware mode. The hardware (another
                                                                                    module) clears automatically the
                                                                                    associated RIS flag. */
/* GPIOC_EVT_MODE[EVT1_CFG] Bits */
#define GPIOC_EVT_MODE_EVT1_CFG_OFS              (2)                             /* !< EVT1_CFG Offset */
#define GPIOC_EVT_MODE_EVT1_CFG_MASK             ((uint32_t)0x0000000CU)         /* !< Event line mode select for event
                                                                                    corresponding to
                                                                                    [IPSTANDARD.GEN_EVENT0] */
#define GPIOC_EVT_MODE_EVT1_CFG_DISABLE          ((uint32_t)0x00000000U)         /* !< The interrupt or event line is
                                                                                    disabled. */
#define GPIOC_EVT_MODE_EVT1_CFG_SOFTWARE         ((uint32_t)0x00000004U)         /* !< The interrupt or event line is in
                                                                                    software mode. Software must clear
                                                                                    the RIS. */
#define GPIOC_EVT_MODE_EVT1_CFG_HARDWARE         ((uint32_t)0x00000008U)         /* !< The interrupt or event line is in
                                                                                    hardware mode. The hardware (another
                                                                                    module) clears automatically the
                                                                                    associated RIS flag. */
/* GPIOC_EVT_MODE[EVT2_CFG] Bits */
#define GPIOC_EVT_MODE_EVT2_CFG_OFS              (4)                             /* !< EVT2_CFG Offset */
#define GPIOC_EVT_MODE_EVT2_CFG_MASK             ((uint32_t)0x00000030U)         /* !< Event line mode select for event
                                                                                    corresponding to
                                                                                    [IPSTANDARD.GEN_EVENT1] */
#define GPIOC_EVT_MODE_EVT2_CFG_DISABLE          ((uint32_t)0x00000000U)         /* !< The interrupt or event line is
                                                                                    disabled. */
#define GPIOC_EVT_MODE_EVT2_CFG_SOFTWARE         ((uint32_t)0x00000010U)         /* !< The interrupt or event line is in
                                                                                    software mode. Software must clear
                                                                                    the RIS. */
#define GPIOC_EVT_MODE_EVT2_CFG_HARDWARE         ((uint32_t)0x00000020U)         /* !< The interrupt or event line is in
                                                                                    hardware mode. The hardware (another
                                                                                    module) clears automatically the
                                                                                    associated RIS flag. */

