TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_gpioc.h
/* GPIOC_DESC Bits */
/* GPIOC_DESC[MINREV] Bits */
#define GPIOC_DESC_MINREV_OFS                    (0)                             /* !< MINREV Offset */
#define GPIOC_DESC_MINREV_MASK                   ((uint32_t)0x0000000FU)         /* !< Minor rev of the IP */
#define GPIOC_DESC_MINREV_MINIMUM                ((uint32_t)0x00000000U)         /* !< Smallest value */
#define GPIOC_DESC_MINREV_MAXIMUM                ((uint32_t)0x0000000FU)         /* !< Highest possible value */
/* GPIOC_DESC[MAJREV] Bits */
#define GPIOC_DESC_MAJREV_OFS                    (4)                             /* !< MAJREV Offset */
#define GPIOC_DESC_MAJREV_MASK                   ((uint32_t)0x000000F0U)         /* !< Major rev of the IP */
#define GPIOC_DESC_MAJREV_MINIMUM                ((uint32_t)0x00000000U)         /* !< Smallest value */
#define GPIOC_DESC_MAJREV_MAXIMUM                ((uint32_t)0x000000F0U)         /* !< Highest possible value */
/* GPIOC_DESC[FEATUREVER] Bits */
#define GPIOC_DESC_FEATUREVER_OFS                (12)                            /* !< FEATUREVER Offset */
#define GPIOC_DESC_FEATUREVER_MASK               ((uint32_t)0x0000F000U)         /* !< Feature Set for the module
                                                                                    *instance* */
#define GPIOC_DESC_FEATUREVER_MINIMUM            ((uint32_t)0x00000000U)         /* !< Smallest value */
#define GPIOC_DESC_FEATUREVER_MAXIMUM            ((uint32_t)0x0000F000U)         /* !< Highest possible value */
/* GPIOC_DESC[MODULEID] Bits */
#define GPIOC_DESC_MODULEID_OFS                  (16)                            /* !< MODULEID Offset */
#define GPIOC_DESC_MODULEID_MASK                 ((uint32_t)0xFFFF0000U)         /* !< Module identification contains a
                                                                                    unique peripheral identification
                                                                                    number. The assignments are
                                                                                    maintained in a central database for
                                                                                    all of the platform modules to ensure
                                                                                    uniqueness. */
#define GPIOC_DESC_MODULEID_MINIMUM              ((uint32_t)0x00000000U)         /* !< Smallest value */
#define GPIOC_DESC_MODULEID_MAXIMUM              ((uint32_t)0xFFFF0000U)         /* !< Highest possible value */

/* GPIOC_DOUT3_0 Bits */
/* GPIOC_DOUT3_0[DIO0] Bits */
#define GPIOC_DOUT3_0_DIO0_OFS                   (0)                             /* !< DIO0 Offset */
#define GPIOC_DOUT3_0_DIO0_MASK                  ((uint32_t)0x00000001U)         /* !< This bit sets the value of the pin
                                                                                    configured as DIO0 when the output is
                                                                                    enabled through DOE31_0 register. */
#define GPIOC_DOUT3_0_DIO0_ZERO                  ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define GPIOC_DOUT3_0_DIO0_ONE                   ((uint32_t)0x00000001U)         /* !< Output is set to 1 */
/* GPIOC_DOUT3_0[DIO1] Bits */
#define GPIOC_DOUT3_0_DIO1_OFS                   (8)                             /* !< DIO1 Offset */
#define GPIOC_DOUT3_0_DIO1_MASK                  ((uint32_t)0x00000100U)         /* !< This bit sets the value of the pin
                                                                                    configured as DIO1 when the output is
                                                                                    enabled through DOE31_0 register. */
#define GPIOC_DOUT3_0_DIO1_ZERO                  ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define GPIOC_DOUT3_0_DIO1_ONE                   ((uint32_t)0x00000100U)         /* !< Output is set to 1 */
/* GPIOC_DOUT3_0[DIO2] Bits */
#define GPIOC_DOUT3_0_DIO2_OFS                   (16)                            /* !< DIO2 Offset */
#define GPIOC_DOUT3_0_DIO2_MASK                  ((uint32_t)0x00010000U)         /* !< This bit sets the value of the pin
                                                                                    configured as DIO2 when the output is
                                                                                    enabled through DOE31_0 register. */
#define GPIOC_DOUT3_0_DIO2_ZERO                  ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define GPIOC_DOUT3_0_DIO2_ONE                   ((uint32_t)0x00010000U)         /* !< Output is set to 1 */
/* GPIOC_DOUT3_0[DIO3] Bits */
#define GPIOC_DOUT3_0_DIO3_OFS                   (24)                            /* !< DIO3 Offset */
#define GPIOC_DOUT3_0_DIO3_MASK                  ((uint32_t)0x01000000U)         /* !< This bit sets the value of the pin
                                                                                    configured as DIO3 when the output is
                                                                                    enabled through DOE31_0 register. */
#define GPIOC_DOUT3_0_DIO3_ZERO                  ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define GPIOC_DOUT3_0_DIO3_ONE                   ((uint32_t)0x01000000U)         /* !< Output is set to 1 */

/* GPIOC_DOUT7_4 Bits */
/* GPIOC_DOUT7_4[DIO4] Bits */
#define GPIOC_DOUT7_4_DIO4_OFS                   (0)                             /* !< DIO4 Offset */
#define GPIOC_DOUT7_4_DIO4_MASK                  ((uint32_t)0x00000001U)         /* !< This bit sets the value of the pin
                                                                                    configured as DIO4 when the output is
                                                                                    enabled through DOE31_0 register. */
#define GPIOC_DOUT7_4_DIO4_ZERO                  ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define GPIOC_DOUT7_4_DIO4_ONE                   ((uint32_t)0x00000001U)         /* !< Output is set to 1 */
/* GPIOC_DOUT7_4[DIO5] Bits */
#define GPIOC_DOUT7_4_DIO5_OFS                   (8)                             /* !< DIO5 Offset */
#define GPIOC_DOUT7_4_DIO5_MASK                  ((uint32_t)0x00000100U)         /* !< This bit sets the value of the pin
                                                                                    configured as DIO5 when the output is
                                                                                    enabled through DOE31_0 register. */
#define GPIOC_DOUT7_4_DIO5_ZERO                  ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define GPIOC_DOUT7_4_DIO5_ONE                   ((uint32_t)0x00000100U)         /* !< Output is set to 1 */
/* GPIOC_DOUT7_4[DIO6] Bits */
#define GPIOC_DOUT7_4_DIO6_OFS                   (16)                            /* !< DIO6 Offset */
#define GPIOC_DOUT7_4_DIO6_MASK                  ((uint32_t)0x00010000U)         /* !< This bit sets the value of the pin
                                                                                    configured as DIO6 when the output is
                                                                                    enabled through DOE31_0 register. */
#define GPIOC_DOUT7_4_DIO6_ZERO                  ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define GPIOC_DOUT7_4_DIO6_ONE                   ((uint32_t)0x00010000U)         /* !< Output is set to 1 */
/* GPIOC_DOUT7_4[DIO7] Bits */
#define GPIOC_DOUT7_4_DIO7_OFS                   (24)                            /* !< DIO7 Offset */
#define GPIOC_DOUT7_4_DIO7_MASK                  ((uint32_t)0x01000000U)         /* !< This bit sets the value of the pin
                                                                                    configured as DIO7 when the output is
                                                                                    enabled through DOE31_0 register. */
#define GPIOC_DOUT7_4_DIO7_ZERO                  ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define GPIOC_DOUT7_4_DIO7_ONE                   ((uint32_t)0x01000000U)         /* !< Output is set to 1 */

/* GPIOC_DOUT11_8 Bits */
/* GPIOC_DOUT11_8[DIO8] Bits */
#define GPIOC_DOUT11_8_DIO8_OFS                  (0)                             /* !< DIO8 Offset */
#define GPIOC_DOUT11_8_DIO8_MASK                 ((uint32_t)0x00000001U)         /* !< This bit sets the value of the pin
                                                                                    configured as DIO8 when the output is
                                                                                    enabled through DOE31_0 register. */
#define GPIOC_DOUT11_8_DIO8_ZERO                 ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define GPIOC_DOUT11_8_DIO8_ONE                  ((uint32_t)0x00000001U)         /* !< Output is set to 1 */
/* GPIOC_DOUT11_8[DIO9] Bits */
#define GPIOC_DOUT11_8_DIO9_OFS                  (8)                             /* !< DIO9 Offset */
#define GPIOC_DOUT11_8_DIO9_MASK                 ((uint32_t)0x00000100U)         /* !< This bit sets the value of the pin
                                                                                    configured as DIO9 when the output is
                                                                                    enabled through DOE31_0 register. */
#define GPIOC_DOUT11_8_DIO9_ZERO                 ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define GPIOC_DOUT11_8_DIO9_ONE                  ((uint32_t)0x00000100U)         /* !< Output is set to 1 */
/* GPIOC_DOUT11_8[DIO10] Bits */
#define GPIOC_DOUT11_8_DIO10_OFS                 (16)                            /* !< DIO10 Offset */
#define GPIOC_DOUT11_8_DIO10_MASK                ((uint32_t)0x00010000U)         /* !< This bit sets the value of the pin
                                                                                    configured as DIO10 when the output
                                                                                    is enabled through DOE31_0 register. */
#define GPIOC_DOUT11_8_DIO10_ZERO                ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define GPIOC_DOUT11_8_DIO10_ONE                 ((uint32_t)0x00010000U)         /* !< Output is set to 1 */
/* GPIOC_DOUT11_8[DIO11] Bits */
#define GPIOC_DOUT11_8_DIO11_OFS                 (24)                            /* !< DIO11 Offset */
#define GPIOC_DOUT11_8_DIO11_MASK                ((uint32_t)0x01000000U)         /* !< This bit sets the value of the pin
                                                                                    configured as DIO11 when the output
                                                                                    is enabled through DOE31_0 register. */
#define GPIOC_DOUT11_8_DIO11_ZERO                ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define GPIOC_DOUT11_8_DIO11_ONE                 ((uint32_t)0x01000000U)         /* !< Output is set to 1 */

