TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_gpioc.h
/* GPIOC_DIN3_0 Bits */
/* GPIOC_DIN3_0[DIO0] Bits */
#define GPIOC_DIN3_0_DIO0_OFS                    (0)                             /* !< DIO0 Offset */
#define GPIOC_DIN3_0_DIO0_MASK                   ((uint32_t)0x00000001U)         /* !< This bit reads the data input value
                                                                                    of DIO0. */
#define GPIOC_DIN3_0_DIO0_ZERO                   ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOC_DIN3_0_DIO0_ONE                    ((uint32_t)0x00000001U)         /* !< Input value is 1 */
/* GPIOC_DIN3_0[DIO1] Bits */
#define GPIOC_DIN3_0_DIO1_OFS                    (8)                             /* !< DIO1 Offset */
#define GPIOC_DIN3_0_DIO1_MASK                   ((uint32_t)0x00000100U)         /* !< This bit reads the data input value
                                                                                    of DIO1. */
#define GPIOC_DIN3_0_DIO1_ZERO                   ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOC_DIN3_0_DIO1_ONE                    ((uint32_t)0x00000100U)         /* !< Input value is 1 */
/* GPIOC_DIN3_0[DIO2] Bits */
#define GPIOC_DIN3_0_DIO2_OFS                    (16)                            /* !< DIO2 Offset */
#define GPIOC_DIN3_0_DIO2_MASK                   ((uint32_t)0x00010000U)         /* !< This bit reads the data input value
                                                                                    of DIO2. */
#define GPIOC_DIN3_0_DIO2_ZERO                   ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOC_DIN3_0_DIO2_ONE                    ((uint32_t)0x00010000U)         /* !< Input value is 1 */
/* GPIOC_DIN3_0[DIO3] Bits */
#define GPIOC_DIN3_0_DIO3_OFS                    (24)                            /* !< DIO3 Offset */
#define GPIOC_DIN3_0_DIO3_MASK                   ((uint32_t)0x01000000U)         /* !< This bit reads the data input value
                                                                                    of DIO3. */
#define GPIOC_DIN3_0_DIO3_ZERO                   ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOC_DIN3_0_DIO3_ONE                    ((uint32_t)0x01000000U)         /* !< Input value is 1 */

/* GPIOC_DIN7_4 Bits */
/* GPIOC_DIN7_4[DIO4] Bits */
#define GPIOC_DIN7_4_DIO4_OFS                    (0)                             /* !< DIO4 Offset */
#define GPIOC_DIN7_4_DIO4_MASK                   ((uint32_t)0x00000001U)         /* !< This bit reads the data input value
                                                                                    of DIO4. */
#define GPIOC_DIN7_4_DIO4_ZERO                   ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOC_DIN7_4_DIO4_ONE                    ((uint32_t)0x00000001U)         /* !< Input value is 1 */
/* GPIOC_DIN7_4[DIO5] Bits */
#define GPIOC_DIN7_4_DIO5_OFS                    (8)                             /* !< DIO5 Offset */
#define GPIOC_DIN7_4_DIO5_MASK                   ((uint32_t)0x00000100U)         /* !< This bit reads the data input value
                                                                                    of DIO5. */
#define GPIOC_DIN7_4_DIO5_ZERO                   ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOC_DIN7_4_DIO5_ONE                    ((uint32_t)0x00000100U)         /* !< Input value is 1 */
/* GPIOC_DIN7_4[DIO6] Bits */
#define GPIOC_DIN7_4_DIO6_OFS                    (16)                            /* !< DIO6 Offset */
#define GPIOC_DIN7_4_DIO6_MASK                   ((uint32_t)0x00010000U)         /* !< This bit reads the data input value
                                                                                    of DIO6. */
#define GPIOC_DIN7_4_DIO6_ZERO                   ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOC_DIN7_4_DIO6_ONE                    ((uint32_t)0x00010000U)         /* !< Input value is 1 */
/* GPIOC_DIN7_4[DIO7] Bits */
#define GPIOC_DIN7_4_DIO7_OFS                    (24)                            /* !< DIO7 Offset */
#define GPIOC_DIN7_4_DIO7_MASK                   ((uint32_t)0x01000000U)         /* !< This bit reads the data input value
                                                                                    of DIO7. */
#define GPIOC_DIN7_4_DIO7_ZERO                   ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOC_DIN7_4_DIO7_ONE                    ((uint32_t)0x01000000U)         /* !< Input value is 1 */

/* GPIOC_DIN11_8 Bits */
/* GPIOC_DIN11_8[DIO8] Bits */
#define GPIOC_DIN11_8_DIO8_OFS                   (0)                             /* !< DIO8 Offset */
#define GPIOC_DIN11_8_DIO8_MASK                  ((uint32_t)0x00000001U)         /* !< This bit reads the data input value
                                                                                    of DIO8. */
#define GPIOC_DIN11_8_DIO8_ZERO                  ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOC_DIN11_8_DIO8_ONE                   ((uint32_t)0x00000001U)         /* !< Input value is 1 */
/* GPIOC_DIN11_8[DIO9] Bits */
#define GPIOC_DIN11_8_DIO9_OFS                   (8)                             /* !< DIO9 Offset */
#define GPIOC_DIN11_8_DIO9_MASK                  ((uint32_t)0x00000100U)         /* !< This bit reads the data input value
                                                                                    of DIO9. */
#define GPIOC_DIN11_8_DIO9_ZERO                  ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOC_DIN11_8_DIO9_ONE                   ((uint32_t)0x00000100U)         /* !< Input value is 1 */
/* GPIOC_DIN11_8[DIO10] Bits */
#define GPIOC_DIN11_8_DIO10_OFS                  (16)                            /* !< DIO10 Offset */
#define GPIOC_DIN11_8_DIO10_MASK                 ((uint32_t)0x00010000U)         /* !< This bit reads the data input value
                                                                                    of DIO10. */
#define GPIOC_DIN11_8_DIO10_ZERO                 ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOC_DIN11_8_DIO10_ONE                  ((uint32_t)0x00010000U)         /* !< Input value is 1 */
/* GPIOC_DIN11_8[DIO11] Bits */
#define GPIOC_DIN11_8_DIO11_OFS                  (24)                            /* !< DIO11 Offset */
#define GPIOC_DIN11_8_DIO11_MASK                 ((uint32_t)0x01000000U)         /* !< This bit reads the data input value
                                                                                    of DIO11. */
#define GPIOC_DIN11_8_DIO11_ZERO                 ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOC_DIN11_8_DIO11_ONE                  ((uint32_t)0x01000000U)         /* !< Input value is 1 */

/* GPIOC_DIN15_12 Bits */
/* GPIOC_DIN15_12[DIO12] Bits */
#define GPIOC_DIN15_12_DIO12_OFS                 (0)                             /* !< DIO12 Offset */
#define GPIOC_DIN15_12_DIO12_MASK                ((uint32_t)0x00000001U)         /* !< This bit reads the data input value
                                                                                    of DIO12. */
#define GPIOC_DIN15_12_DIO12_ZERO                ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOC_DIN15_12_DIO12_ONE                 ((uint32_t)0x00000001U)         /* !< Input value is 1 */
/* GPIOC_DIN15_12[DIO13] Bits */
#define GPIOC_DIN15_12_DIO13_OFS                 (8)                             /* !< DIO13 Offset */
#define GPIOC_DIN15_12_DIO13_MASK                ((uint32_t)0x00000100U)         /* !< This bit reads the data input value
                                                                                    of DIO13. */
#define GPIOC_DIN15_12_DIO13_ZERO                ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOC_DIN15_12_DIO13_ONE                 ((uint32_t)0x00000100U)         /* !< Input value is 1 */
/* GPIOC_DIN15_12[DIO14] Bits */
#define GPIOC_DIN15_12_DIO14_OFS                 (16)                            /* !< DIO14 Offset */
#define GPIOC_DIN15_12_DIO14_MASK                ((uint32_t)0x00010000U)         /* !< This bit reads the data input value
                                                                                    of DIO14. */
#define GPIOC_DIN15_12_DIO14_ZERO                ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOC_DIN15_12_DIO14_ONE                 ((uint32_t)0x00010000U)         /* !< Input value is 1 */
/* GPIOC_DIN15_12[DIO15] Bits */
#define GPIOC_DIN15_12_DIO15_OFS                 (24)                            /* !< DIO15 Offset */
#define GPIOC_DIN15_12_DIO15_MASK                ((uint32_t)0x01000000U)         /* !< This bit reads the data input value
                                                                                    of DIO15. */
#define GPIOC_DIN15_12_DIO15_ZERO                ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOC_DIN15_12_DIO15_ONE                 ((uint32_t)0x01000000U)         /* !< Input value is 1 */

/* GPIOC_DIN19_16 Bits */
/* GPIOC_DIN19_16[DIO16] Bits */
#define GPIOC_DIN19_16_DIO16_OFS                 (0)                             /* !< DIO16 Offset */
#define GPIOC_DIN19_16_DIO16_MASK                ((uint32_t)0x00000001U)         /* !< This bit reads the data input value
                                                                                    of DIO16. */
#define GPIOC_DIN19_16_DIO16_ZERO                ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOC_DIN19_16_DIO16_ONE                 ((uint32_t)0x00000001U)         /* !< Input value is 1 */
/* GPIOC_DIN19_16[DIO17] Bits */
#define GPIOC_DIN19_16_DIO17_OFS                 (8)                             /* !< DIO17 Offset */
#define GPIOC_DIN19_16_DIO17_MASK                ((uint32_t)0x00000100U)         /* !< This bit reads the data input value
                                                                                    of DIO17. */
#define GPIOC_DIN19_16_DIO17_ZERO                ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOC_DIN19_16_DIO17_ONE                 ((uint32_t)0x00000100U)         /* !< Input value is 1 */
/* GPIOC_DIN19_16[DIO18] Bits */
#define GPIOC_DIN19_16_DIO18_OFS                 (16)                            /* !< DIO18 Offset */
#define GPIOC_DIN19_16_DIO18_MASK                ((uint32_t)0x00010000U)         /* !< This bit reads the data input value
                                                                                    of DIO18. */
#define GPIOC_DIN19_16_DIO18_ZERO                ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOC_DIN19_16_DIO18_ONE                 ((uint32_t)0x00010000U)         /* !< Input value is 1 */
/* GPIOC_DIN19_16[DIO19] Bits */
#define GPIOC_DIN19_16_DIO19_OFS                 (24)                            /* !< DIO19 Offset */
#define GPIOC_DIN19_16_DIO19_MASK                ((uint32_t)0x01000000U)         /* !< This bit reads the data input value
                                                                                    of DIO19. */
#define GPIOC_DIN19_16_DIO19_ZERO                ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOC_DIN19_16_DIO19_ONE                 ((uint32_t)0x01000000U)         /* !< Input value is 1 */

