TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_gpioc.h
/* GPIOC_DIN23_20 Bits */
/* GPIOC_DIN23_20[DIO20] Bits */
#define GPIOC_DIN23_20_DIO20_OFS                 (0)                             /* !< DIO20 Offset */
#define GPIOC_DIN23_20_DIO20_MASK                ((uint32_t)0x00000001U)         /* !< This bit reads the data input value
                                                                                    of DIO20. */
#define GPIOC_DIN23_20_DIO20_ZERO                ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOC_DIN23_20_DIO20_ONE                 ((uint32_t)0x00000001U)         /* !< Input value is 1 */
/* GPIOC_DIN23_20[DIO21] Bits */
#define GPIOC_DIN23_20_DIO21_OFS                 (8)                             /* !< DIO21 Offset */
#define GPIOC_DIN23_20_DIO21_MASK                ((uint32_t)0x00000100U)         /* !< This bit reads the data input value
                                                                                    of DIO21. */
#define GPIOC_DIN23_20_DIO21_ZERO                ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOC_DIN23_20_DIO21_ONE                 ((uint32_t)0x00000100U)         /* !< Input value is 1 */
/* GPIOC_DIN23_20[DIO22] Bits */
#define GPIOC_DIN23_20_DIO22_OFS                 (16)                            /* !< DIO22 Offset */
#define GPIOC_DIN23_20_DIO22_MASK                ((uint32_t)0x00010000U)         /* !< This bit reads the data input value
                                                                                    of DIO22. */
#define GPIOC_DIN23_20_DIO22_ZERO                ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOC_DIN23_20_DIO22_ONE                 ((uint32_t)0x00010000U)         /* !< Input value is 1 */
/* GPIOC_DIN23_20[DIO23] Bits */
#define GPIOC_DIN23_20_DIO23_OFS                 (24)                            /* !< DIO23 Offset */
#define GPIOC_DIN23_20_DIO23_MASK                ((uint32_t)0x01000000U)         /* !< This bit reads the data input value
                                                                                    of DIO23. */
#define GPIOC_DIN23_20_DIO23_ZERO                ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOC_DIN23_20_DIO23_ONE                 ((uint32_t)0x01000000U)         /* !< Input value is 1 */

/* GPIOC_DIN27_24 Bits */
/* GPIOC_DIN27_24[DIO24] Bits */
#define GPIOC_DIN27_24_DIO24_OFS                 (0)                             /* !< DIO24 Offset */
#define GPIOC_DIN27_24_DIO24_MASK                ((uint32_t)0x00000001U)         /* !< This bit reads the data input value
                                                                                    of DIO24. */
#define GPIOC_DIN27_24_DIO24_ZERO                ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOC_DIN27_24_DIO24_ONE                 ((uint32_t)0x00000001U)         /* !< Input value is 1 */
/* GPIOC_DIN27_24[DIO25] Bits */
#define GPIOC_DIN27_24_DIO25_OFS                 (8)                             /* !< DIO25 Offset */
#define GPIOC_DIN27_24_DIO25_MASK                ((uint32_t)0x00000100U)         /* !< This bit reads the data input value
                                                                                    of DIO25. */
#define GPIOC_DIN27_24_DIO25_ZERO                ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOC_DIN27_24_DIO25_ONE                 ((uint32_t)0x00000100U)         /* !< Input value is 1 */
/* GPIOC_DIN27_24[DIO26] Bits */
#define GPIOC_DIN27_24_DIO26_OFS                 (16)                            /* !< DIO26 Offset */
#define GPIOC_DIN27_24_DIO26_MASK                ((uint32_t)0x00010000U)         /* !< This bit reads the data input value
                                                                                    of DIO26. */
#define GPIOC_DIN27_24_DIO26_ZERO                ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOC_DIN27_24_DIO26_ONE                 ((uint32_t)0x00010000U)         /* !< Input value is 1 */
/* GPIOC_DIN27_24[DIO27] Bits */
#define GPIOC_DIN27_24_DIO27_OFS                 (24)                            /* !< DIO27 Offset */
#define GPIOC_DIN27_24_DIO27_MASK                ((uint32_t)0x01000000U)         /* !< This bit reads the data input value
                                                                                    of DIO27. */
#define GPIOC_DIN27_24_DIO27_ZERO                ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOC_DIN27_24_DIO27_ONE                 ((uint32_t)0x01000000U)         /* !< Input value is 1 */

/* GPIOC_DIN31_28 Bits */
/* GPIOC_DIN31_28[DIO28] Bits */
#define GPIOC_DIN31_28_DIO28_OFS                 (0)                             /* !< DIO28 Offset */
#define GPIOC_DIN31_28_DIO28_MASK                ((uint32_t)0x00000001U)         /* !< This bit reads the data input value
                                                                                    of DIO28. */
#define GPIOC_DIN31_28_DIO28_ZERO                ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOC_DIN31_28_DIO28_ONE                 ((uint32_t)0x00000001U)         /* !< Input value is 1 */
/* GPIOC_DIN31_28[DIO29] Bits */
#define GPIOC_DIN31_28_DIO29_OFS                 (8)                             /* !< DIO29 Offset */
#define GPIOC_DIN31_28_DIO29_MASK                ((uint32_t)0x00000100U)         /* !< This bit reads the data input value
                                                                                    of DIO29. */
#define GPIOC_DIN31_28_DIO29_ZERO                ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOC_DIN31_28_DIO29_ONE                 ((uint32_t)0x00000100U)         /* !< Input value is 1 */
/* GPIOC_DIN31_28[DIO30] Bits */
#define GPIOC_DIN31_28_DIO30_OFS                 (16)                            /* !< DIO30 Offset */
#define GPIOC_DIN31_28_DIO30_MASK                ((uint32_t)0x00010000U)         /* !< This bit reads the data input value
                                                                                    of DIO30. */
#define GPIOC_DIN31_28_DIO30_ZERO                ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOC_DIN31_28_DIO30_ONE                 ((uint32_t)0x00010000U)         /* !< Input value is 1 */
/* GPIOC_DIN31_28[DIO31] Bits */
#define GPIOC_DIN31_28_DIO31_OFS                 (24)                            /* !< DIO31 Offset */
#define GPIOC_DIN31_28_DIO31_MASK                ((uint32_t)0x01000000U)         /* !< This bit reads the data input value
                                                                                    of DIO31. */
#define GPIOC_DIN31_28_DIO31_ZERO                ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOC_DIN31_28_DIO31_ONE                 ((uint32_t)0x01000000U)         /* !< Input value is 1 */

